marcorussi/nrf52_ethernet/ksz8851_reg.h
#define REG_WOL_FRAME0_CRC0           0x30      /* WF0CRC0 */
#define REG_WOL_FRAME0_CRC1           0x32    /* WF0CRC1 */
#define REG_WOL_FRAME0_BYTE_MASK0     0x34    /* WF0BM0 */
#define REG_WOL_FRAME0_BYTE_MASK1     0x36    /* WF0BM1 */
#define REG_WOL_FRAME0_BYTE_MASK2     0x38    /* WF0BM2 */
#define REG_WOL_FRAME0_BYTE_MASK3     0x3A      /* WF0BM3 */

#define REG_WOL_FRAME1_CRC0           0x40    /* WF1CRC0 */
#define REG_WOL_FRAME1_CRC1           0x42      /* WF1CRC1 */
#define REG_WOL_FRAME1_BYTE_MASK0     0x44    /* WF1BM0 */
#define REG_WOL_FRAME1_BYTE_MASK1     0x46      /* WF1BM1 */
#define REG_WOL_FRAME1_BYTE_MASK2     0x48    /* WF1BM2 */
#define REG_WOL_FRAME1_BYTE_MASK3     0x4A    /* WF1BM3 */

#define REG_WOL_FRAME2_CRC0           0x50    /* WF2CRC0 */
#define REG_WOL_FRAME2_CRC1           0x52      /* WF2CRC1 */
#define REG_WOL_FRAME2_BYTE_MASK0     0x54    /* WF2BM0 */
#define REG_WOL_FRAME2_BYTE_MASK1     0x56    /* WF2BM1 */
#define REG_WOL_FRAME2_BYTE_MASK2     0x58    /* WF2BM2 */
#define REG_WOL_FRAME2_BYTE_MASK3     0x5A    /* WF2BM3 */

#define REG_WOL_FRAME3_CRC0           0x60    /* WF3CRC0 */
#define REG_WOL_FRAME3_CRC1           0x62    /* WF3CRC1 */
#define REG_WOL_FRAME3_BYTE_MASK0     0x64    /* WF3BM0 */
#define REG_WOL_FRAME3_BYTE_MASK1     0x66    /* WF3BM1 */
#define REG_WOL_FRAME3_BYTE_MASK2     0x68    /* WF3BM2 */
#define REG_WOL_FRAME3_BYTE_MASK3     0x6A      /* WF3BM3 */

/*
 * Transmit/Receive Control Registers
 * (Offset 0x70 - 0x9F)
 */

/* Transmit Frame Header */
#define REG_QDR_DUMMY                 0x00    /* Dummy address to access QMU RxQ, TxQ */
#define TX_CTRL_INTERRUPT_ON          0x8000  /* Transmit Interrupt on Completion */

#define REG_TX_CTRL                   0x70    /* TXCR */
#define TX_CTRL_ICMP_CHECKSUM         0x0100  /* Enable ICMP frame checksum generation */
#define TX_CTRL_UDP_CHECKSUM          0x0080   /* Enable UDP frame checksum generation */
#define TX_CTRL_TCP_CHECKSUM          0x0040   /* Enable TCP frame checksum generation */
#define TX_CTRL_IP_CHECKSUM           0x0020   /* Enable IP frame checksum generation */
#define TX_CTRL_FLUSH_QUEUE           0x0010   /* Clear transmit queue, reset tx frame pointer */
#define TX_CTRL_FLOW_ENABLE           0x0008   /* Enable transmit flow control */
#define TX_CTRL_PAD_ENABLE            0x0004   /* Eanble adding a padding to a packet shorter than 64 bytes */
#define TX_CTRL_CRC_ENABLE            0x0002   /* Enable adding a CRC to the end of transmit frame */
#define TX_CTRL_ENABLE                0x0001   /* Enable tranmsit */

#define REG_TX_STATUS                 0x72     /* TXSR */
#define TX_STAT_LATE_COL              0x2000   /* Tranmsit late collision occurs */
#define TX_STAT_MAX_COL               0x1000   /* Tranmsit maximum collision is reached */
#define TX_FRAME_ID_MASK              0x003F   /* Transmit frame ID mask */
#define TX_STAT_ERRORS                ( TX_STAT_MAX_COL | TX_STAT_LATE_COL )

#define REG_RX_CTRL1                  0x74     /* RXCR1 */
#define RX_CTRL_FLUSH_QUEUE           0x8000  /* Clear receive queue, reset rx frame pointer */
#define RX_CTRL_UDP_CHECKSUM          0x4000   /* Enable UDP frame checksum verification */
#define RX_CTRL_TCP_CHECKSUM          0x2000   /* Enable TCP frame checksum verification */
#define RX_CTRL_IP_CHECKSUM           0x1000   /* Enable IP frame checksum verification */
#define RX_CTRL_MAC_FILTER            0x0800   /* Receive with address that pass MAC address filtering */
#define RX_CTRL_FLOW_ENABLE           0x0400   /* Enable receive flow control */
#define RX_CTRL_BAD_PACKET            0x0200   /* Eanble receive CRC error frames */
#define RX_CTRL_MULTICAST             0x0100   /* Receive multicast frames that pass the CRC hash filtering */
#define RX_CTRL_BROADCAST             0x0080   /* Receive all the broadcast frames */
#define RX_CTRL_ALL_MULTICAST         0x0040   /* Receive all the multicast frames (including broadcast frames) */
#define RX_CTRL_UNICAST               0x0020   /* Receive unicast frames that match the device MAC address */
#define RX_CTRL_PROMISCUOUS           0x0010   /* Receive all incoming frames, regardless of frame's DA */
#define RX_CTRL_STRIP_CRC             0x0008   /* Enable strip CRC on the received frames */
#define RX_CTRL_INVERSE_FILTER        0x0002   /* Receive with address check in inverse filtering mode */
#define RX_CTRL_ENABLE                0x0001   /* Enable receive */

/* Address filtering scheme mask */
#define RX_CTRL_FILTER_MASK         ( RX_CTRL_INVERSE_FILTER | RX_CTRL_PROMISCUOUS | RX_CTRL_MULTICAST | RX_CTRL_MAC_FILTER )

#define REG_RX_CTRL2                  0x76     /* RXCR2 */
#define RX_CTRL_IPV6_UDP_NOCHECKSUM   0x0010   /* No checksum generation and verification if IPv6 UDP is fragment */
#define RX_CTRL_IPV6_UDP_CHECKSUM     0x0008   /* Receive pass IPv6 UDP frame with UDP checksum is zero */
#define RX_CTRL_UDP_LITE_CHECKSUM     0x0004   /* Enable UDP Lite frame checksum generation and verification */
#define RX_CTRL_ICMP_CHECKSUM         0x0002   /* Enable ICMP frame checksum verification */
#define RX_CTRL_BLOCK_MAC             0x0001   /* Receive drop frame if the SA is same as device MAC address */
#define RX_CTRL_BURST_LEN_MASK        0x00e0    /* SRDBL SPI Receive Data Burst Length */
#define RX_CTRL_BURST_LEN_4           0x0000
#define RX_CTRL_BURST_LEN_8           0x0020
#define RX_CTRL_BURST_LEN_16          0x0040
#define RX_CTRL_BURST_LEN_32          0x0060
#define RX_CTRL_BURST_LEN_FRAME       0x0080

#define REG_TX_MEM_INFO               0x78     /* TXMIR */
#define TX_MEM_AVAILABLE_MASK         0x1FFF   /* The amount of memory available in TXQ */

#define REG_RX_FHR_STATUS             0x7C     /* RXFHSR */
#define RX_VALID                      0x8000   /* Frame in the receive packet memory is valid */
#define RX_ICMP_ERROR                 0x2000   /* ICMP checksum field doesn't match */
#define RX_IP_ERROR                   0x1000   /* IP checksum field doesn't match */
#define RX_TCP_ERROR                  0x0800   /* TCP checksum field doesn't match */
#define RX_UDP_ERROR                  0x0400   /* UDP checksum field doesn't match */
#define RX_BROADCAST                  0x0080   /* Received frame is a broadcast frame */
#define RX_MULTICAST                  0x0040   /* Received frame is a multicast frame */
#define RX_UNICAST                    0x0020   /* Received frame is a unicast frame */
#define RX_PHY_ERROR                  0x0010   /* Received frame has runt error */
#define RX_FRAME_ETHER                0x0008   /* Received frame is an Ethernet-type frame */
#define RX_TOO_LONG                   0x0004   /* Received frame length exceeds max size 0f 2048 bytes */
#define RX_RUNT_ERROR                 0x0002   /* Received frame was demaged by a collision */
#define RX_BAD_CRC                    0x0001   /* Received frame has a CRC error */
#define RX_ERRORS                     ( RX_BAD_CRC | RX_TOO_LONG | RX_RUNT_ERROR | RX_PHY_ERROR | \
                                      RX_ICMP_ERROR | RX_IP_ERROR | RX_TCP_ERROR | RX_UDP_ERROR )

#define REG_RX_FHR_BYTE_CNT           0x7E     /* RXFHBCR */
#define RX_BYTE_CNT_MASK              0x0FFF   /* Received frame byte size mask */

#define REG_TXQ_CMD                   0x80     /* TXQCR */
#define TXQ_AUTO_ENQUEUE              0x0004   /* Enable enqueue tx frames from tx buffer automatically */
#define TXQ_MEM_AVAILABLE_INT         0x0002   /* Enable generate interrupt when tx memory is available */
#define TXQ_ENQUEUE                   0x0001   /* Enable enqueue tx frames one frame at a time */

#define REG_RXQ_CMD                   0x82     /* RXQCR */
#define RXQ_STAT_TIME_INT             0x1000   /* RX interrupt is occured by timer duration */
#define RXQ_STAT_BYTE_CNT_INT         0x0800   /* RX interrupt is occured by byte count threshold */
#define RXQ_STAT_FRAME_CNT_INT        0x0400   /* RX interrupt is occured by frame count threshold */
#define RXQ_TWOBYTE_OFFSET            0x0200   /* Enable adding 2-byte before frame header for IP aligned with DWORD */
#define RXQ_TIME_INT                  0x0080   /* Enable RX interrupt by timer duration */
#define RXQ_BYTE_CNT_INT              0x0040   /* Enable RX interrupt by byte count threshold */
#define RXQ_FRAME_CNT_INT             0x0020   /* Enable RX interrupt by frame count threshold */
#define RXQ_AUTO_DEQUEUE              0x0010   /* Enable release rx frames from rx buffer automatically */
#define RXQ_START                     0x0008   /* Start QMU transfer operation */
#define RXQ_CMD_FREE_PACKET           0x0001   /* Manual dequeue (release the current frame from RxQ) */

#define RXQ_CMD_CNTL                  (RXQ_FRAME_CNT_INT|RXQ_AUTO_DEQUEUE)

#define REG_TX_ADDR_PTR               0x84     /* TXFDPR */
#define REG_RX_ADDR_PTR               0x86     /* RXFDPR */
#define ADDR_PTR_AUTO_INC             0x4000   /* Enable Frame data pointer increments automatically */
#define ADDR_PTR_MASK                 0x03ff   /* Address pointer mask */

#define REG_RX_TIME_THRES             0x8C     /* RXDTTR */
#define RX_TIME_THRESHOLD_MASK        0xFFFF   /* Set receive timer duration threshold */

#define REG_RX_BYTE_CNT_THRES         0x8E     /* RXDBCTR */
#define RX_BYTE_THRESHOLD_MASK        0xFFFF  /* Set receive byte count threshold */

#define REG_INT_MASK                  0x90     /* IER */
#define INT_PHY                       0x8000   /* Enable link change interrupt */
#define INT_TX                        0x4000   /* Enable transmit done interrupt */
#define INT_RX                        0x2000   /* Enable receive interrupt */
#define INT_RX_OVERRUN                0x0800   /* Enable receive overrun interrupt */
#define INT_TX_STOPPED                0x0200   /* Enable transmit process stopped interrupt */
#define INT_RX_STOPPED                0x0100   /* Enable receive process stopped interrupt */
#define INT_TX_SPACE                  0x0040   /* Enable transmit space available interrupt */
#define INT_RX_WOL_FRAME              0x0020   /* Enable WOL on receive wake-up frame detect interrupt */
#define INT_RX_WOL_MAGIC              0x0010   /* Enable WOL on receive magic packet detect interrupt */
#define INT_RX_WOL_LINKUP             0x0008   /* Enable WOL on link up detect interrupt */
#define INT_RX_WOL_ENERGY             0x0004   /* Enable WOL on energy detect interrupt */
#define INT_RX_SPI_ERROR              0x0002   /* Enable receive SPI bus error interrupt */
#define INT_RX_WOL_DELAY_ENERGY       0x0001   /* Enable WOL on delay energy detect interrupt */
#define INT_MASK                      ( INT_RX | INT_TX | INT_PHY )

#define REG_INT_STATUS                0x92      /* ISR */

#define REG_RX_FRAME_CNT_THRES        0x9C     /* RXFCTFC */
#define RX_FRAME_CNT_MASK             0xFF00   /* Received frame count mask */
#define RX_FRAME_THRESHOLD_MASK       0x00FF   /* Set receive frame count threshold mask */

#define REG_TX_TOTAL_FRAME_SIZE       0x9E     /* TXNTFSR */
#define TX_TOTAL_FRAME_SIZE_MASK      0xFFFF   /* Set next total tx frame size mask */

