marcorussi/nrf52_ethernet/ksz8851_reg.h
/*
 * MAC Address Hash Table Control Registers
 * (Offset 0xA0 - 0xA7)
 */
#define REG_MAC_HASH_0                0xA0    /* MAHTR0 */
#define REG_MAC_HASH_1                0xA1
#define REG_MAC_HASH_2                0xA2      /* MAHTR1 */
#define REG_MAC_HASH_3                0xA3
#define REG_MAC_HASH_4                0xA4    /* MAHTR2 */
#define REG_MAC_HASH_5                0xA5
#define REG_MAC_HASH_6                0xA6      /* MAHTR3 */
#define REG_MAC_HASH_7                0xA7

/*
 * QMU Receive Queue Watermark Control Registers
 * (Offset 0xB0 - 0xB5)
 */
#define REG_RX_LOW_WATERMARK          0xB0    /* FCLWR */
#define RX_LOW_WATERMARK_MASK         0x0FFF   /* Set QMU RxQ low watermark mask */

#define REG_RX_HIGH_WATERMARK         0xB2     /* FCHWR */
#define RX_HIGH_WATERMARK_MASK        0x0FFF   /* Set QMU RxQ high watermark mask */

#define REG_RX_OVERRUN_WATERMARK      0xB4     /* FCOWR */
#define RX_OVERRUN_WATERMARK_MASK     0x0FFF    /* Set QMU RxQ overrun watermark mask */

/*
 * Global Control Registers
 * (Offset 0xC0 - 0xD3)
 */
#define REG_CHIP_ID                   0xC0      /* CIDER */
#define CHIP_ID_MASK                  0xFFF0   /* Family ID and chip ID mask */
#define REVISION_MASK                 0x000E   /* Chip revision mask */
#define CHIP_ID_SHIFT                 4
#define REVISION_SHIFT                1
#define CHIP_ID_8851_16               0x8870   /* KS8851-16/32MQL chip ID */

#define REG_LED_CTRL                  0xC6     /* CGCR */
#define LED_CTRL_SEL1               0x8000   /* Select LED3/LED2/LED1/LED0 indication */
#define LED_CTRL_SEL0                 0x0200   /* Select LED3/LED2/LED1/LED0 indication */

#define REG_IND_IACR                  0xC8    /* IACR */
#define TABLE_READ                    0x1000    /* Indirect read */
#define TABLE_MIB                     0x0C00    /* Select MIB counter table */
#define TABLE_ENTRY_MASK              0x001F    /* Set table entry to access */

#define REG_IND_DATA_LOW              0xD0    /* IADLR */
#define REG_IND_DATA_HIGH             0xD2    /* IADHR */

/*
 * Power Management Control Registers
 * (Offset 0xD4 - 0xD7)
 */
#define REG_POWER_CNTL                0xD4      /* PMECR */
#define PME_DELAY_ENABLE              0x4000   /* Enable the PME output pin assertion delay */
#define PME_ACTIVE_HIGHT              0x1000   /* PME output pin is active high */
#define PME_FROM_WKFRAME              0x0800   /* PME asserted when wake-up frame is detected */
#define PME_FROM_MAGIC                0x0400   /* PME asserted when magic packet is detected */
#define PME_FROM_LINKUP               0x0200  /* PME asserted when link up is detected */
#define PME_FROM_ENERGY               0x0100   /* PME asserted when energy is detected */
#define PME_EVENT_MASK                0x0F00   /* PME asserted event mask */
#define WAKEUP_AUTO_ENABLE            0x0080   /* Enable auto wake-up in energy mode */
#define WAKEUP_NORMAL_AUTO_ENABLE     0x0040   /* Enable auto goto normal mode from energy detecion mode */
#define WAKEUP_FROM_WKFRAME           0x0020   /* Wake-up from wake-up frame event detected */
#define WAKEUP_FROM_MAGIC             0x0010   /* Wake-up from magic packet event detected */
#define WAKEUP_FROM_LINKUP            0x0008   /* Wake-up from link up event detected */
#define WAKEUP_FROM_ENERGY            0x0004   /* Wake-up from energy event detected */
#define WAKEUP_EVENT_MASK             0x003C   /* Wake-up event mask */
#define POWER_STATE_D1                0x0003   /* Power saving mode */
#define POWER_STATE_D3                0x0002   /* Power down mode */
#define POWER_STATE_D2                0x0001   /* Power detection mode */
#define POWER_STATE_D0                0x0000   /* Normal operation mode (default) */
#define POWER_STATE_MASK              0x0003   /* Power management mode mask */

#define REG_WAKEUP_TIME             0xD6    /* GSWUTR */
#define WAKEUP_TIME                   0xFF00   /* Min time (sec) wake-uo after detected energy */
#define GOSLEEP_TIME                  0x00FF   /* Min time (sec) before goto sleep when in energy mode */

/*
 * PHY Control Registers
 * (Offset 0xD8 - 0xF9)
 */
#define REG_PHY_RESET                 0xD8     /* PHYRR */
#define PHY_RESET_REG_VALUE         0x0001  /* Reset PHY */

#define REG_PHY_CNTL                  0xE4     /* P1MBCR */
#define PHY_SPEED_100MBIT             0x2000   /* Force PHY 100Mbps */
#define PHY_AUTO_NEG_ENABLE           0x1000   /* Enable PHY auto-negotiation */
#define PHY_POWER_DOWN                0x0800   /* Set PHY power-down */
#define PHY_AUTO_NEG_RESTART          0x0200   /* Restart PHY auto-negotiation */
#define PHY_FULL_DUPLEX               0x0100   /* Force PHY in full duplex mode */
#define PHY_HP_MDIX                   0x0020   /* Set PHY in HP auto MDI-X mode */
#define PHY_FORCE_MDIX                0x0010   /* Force MDI-X */
#define PHY_AUTO_MDIX_DISABLE         0x0008   /* Disable auto MDI-X */
#define PHY_TRANSMIT_DISABLE          0x0002   /* Disable PHY transmit */
#define PHY_LED_DISABLE               0x0001    /* Disable PHY LED */

#define REG_PHY_STATUS                0xE6     /* P1MBSR */
#define PHY_100BT4_CAPABLE            0x8000   /* 100 BASE-T4 capable */
#define PHY_100BTX_FD_CAPABLE         0x4000   /* 100BASE-TX full duplex capable */
#define PHY_100BTX_CAPABLE            0x2000   /* 100BASE-TX half duplex capable */
#define PHY_10BT_FD_CAPABLE           0x1000   /* 10BASE-TX full duplex capable */
#define PHY_10BT_CAPABLE              0x0800   /* 10BASE-TX half duplex capable */
#define PHY_AUTO_NEG_ACKNOWLEDGE      0x0020   /* Auto-negotiation complete */
#define PHY_AUTO_NEG_CAPABLE          0x0008   /* Auto-negotiation capable */
#define PHY_LINK_UP                   0x0004   /* PHY link is up */
#define PHY_EXTENDED_CAPABILITY       0x0001    /* PHY extended register capable */

#define REG_PHY_ID_LOW                0xE8     /* PHY1ILR */
#define REG_PHY_ID_HIGH               0xEA     /* PHY1IHR */

#define REG_PHY_AUTO_NEGOTIATION      0xEC     /* P1ANAR */
#define PHY_AUTO_NEG_SYM_PAUSE        0x0400   /* Advertise pause capability */
#define PHY_AUTO_NEG_100BTX_FD        0x0100   /* Advertise 100 full-duplex capability */
#define PHY_AUTO_NEG_100BTX           0x0080   /* Advertise 100 half-duplex capability */
#define PHY_AUTO_NEG_10BT_FD          0x0040   /* Advertise 10 full-duplex capability */
#define PHY_AUTO_NEG_10BT             0x0020   /* Advertise 10 half-duplex capability */
#define PHY_AUTO_NEG_SELECTOR         0x001F   /* Selector field mask */
#define PHY_AUTO_NEG_802_3            0x0001  /* 802.3 */

#define REG_PHY_REMOTE_CAPABILITY     0xEE     /* P1ANLPR */
#define PHY_REMOTE_SYM_PAUSE          0x0400   /* Link partner pause capability */
#define PHY_REMOTE_100BTX_FD          0x0100   /* Link partner 100 full-duplex capability */
#define PHY_REMOTE_100BTX             0x0080   /* Link partner 100 half-duplex capability */
#define PHY_REMOTE_10BT_FD            0x0040   /* Link partner 10 full-duplex capability */
#define PHY_REMOTE_10BT               0x0020    /* Link partner 10 half-duplex capability */

