marcorussi/nrf52_ethernet/ksz8851_reg.h
#define REG_PORT_LINK_MD              0xF4     /* P1SCLMD */
#define PORT_CABLE_10M_SHORT          0x8000   /* Cable length is less than 10m short */
#define PORT_CABLE_STAT_FAILED        0x6000   /* Cable diagnostic test fail */
#define PORT_CABLE_STAT_SHORT         0x4000   /* Short condition detected in the cable */
#define PORT_CABLE_STAT_OPEN          0x2000   /* Open condition detected in the cable */
#define PORT_CABLE_STAT_NORMAL        0x0000   /* Normal condition */
#define PORT_CABLE_DIAG_RESULT        0x6000   /* Cable diagnostic test result mask */
#define PORT_START_CABLE_DIAG         0x1000   /* Enable cable diagnostic test */
#define PORT_FORCE_LINK               0x0800   /* Enable force link pass */
#define PORT_POWER_SAVING             0x0400   /* Disable power saving */
#define PORT_REMOTE_LOOPBACK          0x0200   /* Enable remote loopback at PHY */
#define PORT_CABLE_FAULT_COUNTER      0x01FF    /* Cable length distance to the fault */

#define REG_PORT_CTRL                 0xF6    /* P1CR */
#define PORT_LED_OFF                  0x8000   /* Turn off all the port LEDs (LED3/LED2/LED1/LED0) */
#define PORT_TX_DISABLE               0x4000   /* Disable port transmit */
#define PORT_AUTO_NEG_RESTART         0x2000   /* Restart auto-negotiation */
#define PORT_POWER_DOWN               0x0800   /* Set port power-down */
#define PORT_AUTO_MDIX_DISABLE        0x0400   /* Disable auto MDI-X */
#define PORT_FORCE_MDIX               0x0200   /* Force MDI-X */
#define PORT_AUTO_NEG_ENABLE          0x0080   /* Enable auto-negotiation */
#define PORT_FORCE_100_MBIT           0x0040   /* Force PHY 100Mbps */
#define PORT_FORCE_FULL_DUPLEX        0x0020   /* Force PHY in full duplex mode */
#define PORT_AUTO_NEG_SYM_PAUSE       0x0010   /* Advertise pause capability */
#define PORT_AUTO_NEG_100BTX_FD       0x0008   /* Advertise 100 full-duplex capability */
#define PORT_AUTO_NEG_100BTX          0x0004   /* Advertise 100 half-duplex capability */
#define PORT_AUTO_NEG_10BT_FD         0x0002   /* Advertise 10 full-duplex capability */
#define PORT_AUTO_NEG_10BT            0x0001    /* Advertise 10 half-duplex capability */

#define REG_PORT_STATUS               0xF8     /* P1SR */
#define PORT_HP_MDIX                  0x8000   /* Set PHY in HP auto MDI-X mode */
#define PORT_REVERSED_POLARITY        0x2000   /* Polarity is reversed */
#define PORT_RX_FLOW_CTRL             0x1000   /* Reeive flow control feature is active */
#define PORT_TX_FLOW_CTRL             0x0800   /* Transmit flow control feature is active */
#define PORT_STAT_SPEED_100MBIT       0x0400   /* Link is 100Mbps */
#define PORT_STAT_FULL_DUPLEX         0x0200   /* Link is full duplex mode */
#define PORT_MDIX_STATUS              0x0080   /* Is MDI */
#define PORT_AUTO_NEG_COMPLETE        0x0040   /* Auto-negotiation complete */
#define PORT_STATUS_LINK_GOOD         0x0020   /* PHY link is up */
#define PORT_REMOTE_SYM_PAUSE         0x0010   /* Link partner pause capability */
#define PORT_REMOTE_100BTX_FD         0x0008   /* Link partner 100 full-duplex capability */
#define PORT_REMOTE_100BTX            0x0004   /* Link partner 100 half-duplex capability */
#define PORT_REMOTE_10BT_FD           0x0002   /* Link partner 10 full-duplex capability */
#define PORT_REMOTE_10BT              0x0001    /* Link partner 10 half-duplex capability */


#endif
